/*  ************************************************************************************
*								上海芯圣电子股份有限公司
*								    www.holychip.cn
*	************************************************************************************
*	@Author				LiFei
*	@File				Delay.h
*	@Library Version	V1.0.0.0
*	@Date				2017.09.06
*	************************************************************************************
*/
#ifndef	_delay_h
#define _delay_h

void DelayXus(unsigned char t);
void DelayXms(unsigned char t);

#endif