/*
****************************************************
			中山凯鑫德电子股份有限公司
				www.freeyes.net
====================================================
@名字     	inital.c
@说明      	
@作者		lhx6sea
@日期		2018.04.29
****************************************************
*/


#include "Delay.h"


/*==================================================
uS延时函数，含有输入参数 unsigned char t，无返回值
 unsigned char 是定义无符号字符变量，其值的范围是
 0~255 精确延时请使用汇编,大致延时
--------------------------------------------------*/
void DelayXus(unsigned char t)
{   
	while(--t);
}


/*==================================================
 mS延时函数，含有输入参数 unsigned int t，无返回值
 unsigned int 是定义无符号字符变量，其值的范围是
 0~1024 精确延时请使用汇编
--------------------------------------------------*/
void DelayXms(unsigned char t)		//大致延时1mS
{
	while(t--)
	{     
		DelayXus(120);
		DelayXus(125);
	}
}