/*
****************************************************
			中山凯鑫德电子股份有限公司
				www.freeyes.net
====================================================
@名字     	inital.c
@说明      	
@作者		lhx6sea
@日期		2018.04.29
****************************************************
*/

#include    "include.h"


/*
;***********************************************************************
;                            _____________
;                          _|             |_
;                 <P+> VDD|_ 1          8  _|VSS <P->
;                          _|             |_
;                 <--> PB5|_ 2          7  _|PB0 <--- 过压保护
;                          _|             |_
;                 <--> PB4|_ 3          6  _|PB1 <-->
;                          _|             |_
;        按键输入 ---> PB3|_ 4          5  _|PB2 <-->
;                           |_____________|
;
;***********************************************************************
*/


/***********************************************************************
*|``````````````````````````````````````````````````````````````````````
*|  端口初始化: 方向,上下拉,开漏,推挽,电流大小
*|______________________________________________________________________
*/

void inital(void)
{
    						//PB3 输入, PB0 中断, 输入上拉
    PORTB=0X09;             //端口寄存器初始值		输入,置高; 输出,置零
    TRISB=0X09;             //输入 or 输出设置    	1=输入in,  0=输出out
    
    
    //ODCON(0x0C):          // -  - ODB5  ODB4 :: ODB3  ODB2  ODB1  ODB0
    ODCON =0X09;            //开漏设置      0=推挽  ; 1=开漏
        

    //PDCON(0x0B):          //GPR  /PDB2  /PDB1  /PDB0 :: -  -  -  -
    PDCON =0X09;            //下拉设置      0=enable;   1=Disabled
    
    
    //PHCON(0x0D):          // - /PHB3 /PHB5 /PHB4 :: - /PHB2 /PHB1 /PHB0
    PHCON =0XF6;            //上拉设置      0=enable;   1=Disabled    
}


/***********************************************************************
*|``````````````````````````````````````````````````````````````````````
*|  系统初始化: 时钟,中断,看门狗,复位; Fosc=8Mhz/4T, Fsys=2Mhz
*|______________________________________________________________________
*/

void sysinitial(void)
{
    //OPTION:               // -  INTEDG  T0CS  T0SE :: PSA  PS2  PS1  PS0
    OPTION=0X0F;            // Frq(timer0) 1/8   256/128/64/32/~/16/8/4/2/1(WDT,PSA=1)

	//如果编译OPTION选择8M/2T，则Fosc=16M，Fsys=8M，Fcpu=4M。 
    T0=0;                 	// 8位, 溢出(向上,正向)中断; 不可重载  2T,16Mhz

    asm(clrwdt);

    //PCON:                 // WDTEN  EIS LVDF LVDSEL3 || LVDSEL2 LVDSEL1 LVDSEL0 LVDEN
    //PCON:                 // WDTEN  EIS    -      -  ::    -       -       -      -
    PCON=0X00;              // WDTEN: 1=软件使能WDT
    WDTEN=1;

    IOCB=0x08;              // PB3, 按键变化中断/唤醒

    //INTECON(0x0E)         // GIE  -b6- -b5- -b4-  ::  -  INTE  PBIE  T0IE
    INTECON=0;
    
    
    INTE=0;
    INTEDG=0;
    EIS=0;                  //WDTEN.7
    PBIE=1;

}